[
    {
        "title": "Codex (FusionEra 2k25 National Level Competition Organized by Dr.J.J.Magdum College of Engineering , Jaysingpur)",
        "description": "The competition consists of three rounds: the first round emphasizes competitive and rapid problem-solving, the second round tests participants' debugging skills, and the final round challenges teams to build an AI-powered quiz generator.",
        "Rank" : 1,
        "link": "https://drive.google.com/file/d/1Hku-zknYC5bIdoPcgUuNXS_Atfwe0yT3/view?usp=sharing"
    },
    {
        "title": "TECHTRENDT 2K25 National Level Competition Organized by Dr.J.J.Magdum College of Engineering, Jaysingpur",
        "description": "This round tests participants' DSA skills through coding problems focused on logic, efficiency, and core concepts like arrays, strings, trees, graphs, and dynamic programming.",
        "Rank" : 1,
        "link": "https://drive.google.com/file/d/1uMJs9XjEtOyYYhN8LBtyLj6FKK78Ne_Y/view?usp=sharing"
    },
    {
        "title": "QUIZ Competition based on C and Python Organized by Dr.J.J.Magdum College of Engineering , Jaysingpur",
        "description": "The round features MCQs on C and Python, covering syntax, data types, control flow, functions, pointers, OOP (in Python), and standard libraries to assess both theoretical and practical understanding.",
        "Rank" : 2,
        "link": "https://drive.google.com/file/d/1WqI64DBxN2ahaec2pRjnbFDe95yo43Ai/view?usp=sharing"
    },
    {
        "title": "Code Crusade (@NimBus 2k25 National Level Competition Organized by Sanjay Ghowdawat Institude)",
        "description": "The competition consists of three rounds: the first round focuses on individual debugging tasks, the second round involves both debugging and a hide-and-seek-style challenge with my partner, and the final round requires participants to collaboratively solve complex problems.",
        "Rank" : 2,
        "link": "https://drive.google.com/file/d/1Q9Gl2CfQAziRrzz88oJ7D_Ltum5wh9jp/view?usp=drive_link"
    },
    {
        "title": "Lakshya 3.0 2K25 National Level Competition Organized by Dr.J.J.Magdum College of Engineering , Jaysingpur",
        "description": "The competition has three rounds: an aptitude round testing logical and quantitative skills, a technical round assessing core programming knowledge, and a group discussion evaluating communication, teamwork, and idea presentation.",
        "Rank" : 2,
        "link": "https://drive.google.com/file/d/11OQsDpuYiFRgABJITwAOm5HpY3ZqO-0h/view?usp=sharing"
    }
]